{
  "heiress": {
    "kheir": {
      "affinity": 8,
      "dynamic": "Familial",
      "description": "Despite a cold exterior and a lifetime of bickering, the heiress loves and will not let harm come upon the Heir."
    },
    "crusader": {
      "affinity": 5,
      "dynamic": "Professional",
      "description": "The heiress maintains a reserved, professional demeanor towards the crusader, her latest recruit."
    },
    "highwayman": {
      "affinity": 3,
      "dynamic": "Cautious",
      "description": "The heiress regards the highwayman with suspicion. While his skills could prove valuable, his checkered past and gruff manner keep her on guard."
    },
    "hqclaimants": {
      "affinity": 2,
      "dynamic": "Contemptuous Competitors",
      "description": "The Heiress saw the Claimants as vain and insufferable during their fleeting courtly encounters. Their thinly veiled insults ensured no love was lost between them."
    },
    "duchess": {
      "affinity": 3,
      "dynamic": "Cautious Disdain",
      "description": "The Heiress remembers the Duchess as aloof and self-absorbed during the few balls they attended together. Though she barely knew her, the Duchess's pride left a sour impression."
    }
  },
  "crusader": {
    "heiress": {
      "affinity": 5,
      "dynamic": "Professional",
      "description": "The crusader maintains a professional relationship with the heiress, focusing on fulfilling his role as her protector with a devout sense of duty."
    },
    "kheir": {
      "affinity": 4,
      "dynamic": "Skeptical",
      "description": "While the crusader intends to uphold his duty with silent diligence, he realizes the meek Heir is unfit to lead."
    },
    "highwayman": {
      "affinity": 7,
      "dynamic": "Comrade",
      "description": "The crusader sees in the highwayman a kindred spirit; both men with troubled pasts seeking to carve out a purpose through the quest they now share."
    },
    "seraph": {
      "affinity": 4,
      "dynamic": "Devoted Lieutenant",
      "description": "The Crusader served under the Seraph after her miraculous transformation, awed by her divine presence and inspired by her holy purpose. Her burned visage and manifest powers were proof of the Light's grace, making his role in her crusade feel truly righteous."
    }
  },
  "highwayman": {
    "heiress": {
      "affinity": 4,
      "dynamic": "Guardian",
      "description": "The highwayman is determined to prove himself to the heiress and to assist in her quest despite her warranted distrust."
    },
    "kheir": {
      "affinity": 3,
      "dynamic": "Guardian",
      "description": "Despite the Heir's distrust, the highwayman is resolute in his role as a guard, seeing their safety as his path to absolution."
    },
    "crusader": {
      "affinity": 7,
      "dynamic": "Comrade",
      "description": "Despite their differences, the highwayman and the crusader swiftly bonded over the mistakes of their respective pasts and their shared quest for redemption."
    }
  },
  "kheir": {
    "heiress": {
      "affinity": 8,
      "dynamic": "Familial",
      "description": "The Heir admires, and is deeply jealous of, his sister's strength and ability to take initiative. Despite their fierce bickering, the Heir loves his sister."
    },
    "crusader": {
      "affinity": 4,
      "dynamic": "Cautious respect",
      "description": "Though he recognizes the crusader's potential, the Heir is dubious over the trustworthiness of this new guard."
    },
    "highwayman": {
      "affinity": 2,
      "dynamic": "Distrustful",
      "description": "The Heir is distrusting towards the highwayman, fearing that the rugged man will betray them and steal his possessions."
    },
    "hqclaimants": {
      "affinity": 2,
      "dynamic": "Aristocratic Rivalry",
      "description": "The Claimants' constant disdain and biting remarks left a lasting impression on the Heir during the balls and duels of their youth. He remains embittered but grudgingly acknowledges The Claimant brother's skill with a spear."
    },
    "duchess": {
      "affinity": 5,
      "dynamic": "Infatuation",
      "description": "As a young man, the Heir was captivated by the Duchess' elegance and fencing prowess. Though their interactions were brief and unreciprocated, her image lingered in his mind for years."
    }
  },
  "vestal": {
    "flagellant": {
      "affinity": 2,
      "dynamic": "Righteous Fury",
      "description": "The Vestal cannot forget the tortures inflicted by the Flagellant in the name of faith. To her, he represents the cruelty of blind devotion—a symbol of what she has overcome and now stands against."
    }
  },
  "flagellant": {
    "vestal": {
      "affinity": 2,
      "dynamic": "Disdainful Reverence",
      "description": "The Flagellant sees the Vestal as someone who fled her divine retribution, rejecting the sacred suffering he holds dear. Her strength intrigues him, but her defiance fills him with scorn and pity."
    }
  },
  "hqclaimants": {
    "kheir": {
      "affinity": 1,
      "dynamic": "Dismissive Scorn",
      "description": "The Claimants regarded the young Heir as a naive, overeager boy who aspired to noble grandeur but lacked the maturity or intellect to achieve it."
    },
    "heiress": {
      "affinity": 3,
      "dynamic": "Arrogant Derision",
      "description": "The Claimants found the Heiress' sharp wit grating and her ambitions laughable. To them, she was little more than a pretender to aristocratic sophistication."
    },
    "duchess": {
      "affinity": 3,
      "dynamic": "Lingering Resentment",
      "description": "The fading influence of the scheming Claimants served only as a backdrop to the Duchess' greater rivalry with the Countess."
    },
    "wretch": {
      "affinity": 3,
      "dynamic": "Smug Indifference",
      "description": "The Wretch is a relic of a forgotten triumph, a living reminder of the The Claimants' ruthless success. They feel a cold satisfaction in his fall, tempered by fleeting amusement at the absurdity of his new life."
    }
  },
  "duchess": {
    "kheir": {
      "affinity": 4,
      "dynamic": "Amused Indifference",
      "description": "In her brief early encounters with the Heir, the Duchess found his adoration amusing but ultimately inconsequential. His fumbling attempts to court her were quickly forgotten."
    },
    "heiress": {
      "affinity": 3,
      "dynamic": "Distant Contempt",
      "description": "The Duchess barely remembers the Heiress, save for the latter's penchant for lurking at the edges of courtly gatherings. To the Duchess, the young Heiress was an unremarkable presence."
    },
    "hqclaimants": {
      "affinity": 3,
      "dynamic": "Rivalrous Disdain",
      "description": "The fading influence of the scheming the Claimants served only as a backdrop to the Duchess' greater rivalry with the Countess."
    }
  },
  "wretch": {
    "hqclaimants": {
      "affinity": 2,
      "dynamic": "Faded Bitterness",
      "description": "The Wretch has long since resigned himself to the ruin of the Vyrmholt family, finding solace among his rats. Though the bitterness lingers faintly, he sees the Claimants as remnants of a life he left behind—distant, self-congratulatory specters of his disgrace."
    }
  },
  "seraph": {
    "crusader": {
      "affinity": 4,
      "dynamic": "Fallen Servant",
      "description": "The Seraph found in the Crusader a capable commander whose tactical brilliance served the Light's purpose well. His reverence was genuine, his devotion unquestioned, which made his mercy toward the Warlord all the more galling. Though he was among her most trusted generals, his departure from the crusade marked him as another soul too weak to uphold the Light's righteous judgment."
    }
  }
}