{
  "heiress": {
    "kheir": {
      "affinity": 8,
      "dynamic": "Familial",
      "description": "The Heiress maintains a sharp-tongued rapport with her brother, quick to criticize his anxieties in private but equally quick to defend him from others. Beneath the cutting remarks lies fierce protectiveness."
    },
    "crusader": {
      "affinity": 5,
      "dynamic": "Professional",
      "description": "The heiress maintains a reserved, professional demeanor towards the crusader, her latest recruit."
    },
    "highwayman": {
      "affinity": 4,
      "dynamic": "Guarded Pragmatism",
      "description": "The Heiress recognizes the Highwayman's value as a skilled fighter and tracker, though his criminal background requires she remain watchful. She hired him for competence, not trustworthiness."
    },
    "hqclaimants": {
      "affinity": 2,
      "dynamic": "Faded Impression",
      "description": "The Heiress vaguely recalls the Claimants from years ago—a pair of nobles who spent the Ancestor's parties ingratiating themselves to her father. They said something dismissive to her once, she thinks, but she can barely remember their faces now."
    },
    "duchess": {
      "affinity": 3,
      "dynamic": "Cautious Disdain",
      "description": "The Heiress remembers the Duchess as aloof and self-absorbed during the few balls they attended together before the woman disappeared from court. Years and a bloodsucker transformation later, the Heiress doesn't recognise her."
    }
  },
  "crusader": {
    "heiress": {
      "affinity": 5,
      "dynamic": "Professional",
      "description": "The crusader maintains a professional relationship with the heiress, focusing on fulfilling his role as her protector with a devout sense of duty."
    },
    "kheir": {
      "affinity": 4,
      "dynamic": "Skeptical",
      "description": "The Crusader has pledged to protect the Heir despite obvious doubts about his fitness for the trials ahead. He sees a frightened scholar where leadership is needed, but duty demands he try."
    },
    "highwayman": {
      "affinity": 6,
      "dynamic": "Wary Recognition",
      "description": "The Crusader recognizes something familiar in the Highwayman's bearing - another man haunted by his past. He wonders if they might find common ground, though trust must be earned."
    },
    "seraph": {
      "affinity": 4,
      "dynamic": "Devoted Lieutenant",
      "description": "The Crusader served under the Seraph after her miraculous transformation, awed by her divine presence and inspired by her holy purpose. Her burned visage and manifest powers were proof of the Light's grace, making his role in her crusade feel truly righteous."
    }
  },
  "highwayman": {
    "heiress": {
      "affinity": 4,
      "dynamic": "Guardian",
      "description": "The Highwayman is determined to prove his worth to the Heiress and earn a place in her service, seeing this quest as his path to redemption."
    },
    "kheir": {
      "affinity": 3,
      "dynamic": "Guardian",
      "description": "The Highwayman takes his role as the Heir's guard seriously, viewing the nervous scholar's safety as part of his quest for absolution."
    },
    "crusader": {
      "affinity": 6,
      "dynamic": "Hopeful Kinship",
      "description": "The Highwayman sees in the Crusader another man seeking redemption through violence. He hopes this stern warrior might understand the weight of a violent past better than most."
    }
  },
  "kheir": {
    "heiress": {
      "affinity": 8,
      "dynamic": "Familial",
      "description": "The Heir both admires and envies his sister's boldness, feeling perpetually caught between pride in her achievements and inadequacy at his own. Despite their constant bickering, he trusts her completely."
    },
    "crusader": {
      "affinity": 4,
      "dynamic": "Nervous Reliance",
      "description": "The Heir is intimidated by the Crusader's imposing presence and martial bearing, but finds some comfort in having such a formidable protector."
    },
    "highwayman": {
      "affinity": 3,
      "dynamic": "Anxious Wariness",
      "description": "The Heir is deeply uncomfortable around the rough-mannered Highwayman, finding his criminal past and casual violence unsettling despite his sister's trust in hiring him."
    },
    "hqclaimants": {
      "affinity": 2,
      "dynamic": "Youthful Resentment",
      "description": "The Heir met the Claimants at the Ancestor's parties—they were always hovering around his father, flattering him with talk of lineage and legacy. When they deigned to notice the Heir himself, their remarks were cutting and condescending. Sometimes he wonders if they remain as insufferable as he remembers."
    },
    "duchess": {
      "affinity": 5,
      "dynamic": "Haunted Infatuation",
      "description": "As a young man, the Heir was captivated by the Duchess's elegance and fencing prowess at court, back when she was human. Their interactions were brief and unreciprocated, but her image lingered in his mind for years. He worried for her when she, along with the others who attended the Ancestor's final debauch, vanished from society."
    },
    "leper": {
      "affinity": 4,
      "dynamic": "Academic Curiosity",
      "description": "The Heir read of the Leper and the kingdom he once ruled, though the accounts of his abdication were frustratingly vague. He wonders what truly happened."
    },
      "cursed": {
      "affinity": 2,
      "dynamic": "Historical Scorn",
      "description": "The Heir heard tales of the Cursed and the cursed kingdom of Gilneas—a king who unleashed something terrible and betrayed his people. For power, presumably."
    },
      "musketeer": {
      "affinity": 4,
      "dynamic": "Genealogical Connection",
      "description": "The Heir is aware through family records that the Musketeer's bloodline and his own share distant ancestry, though the connection is generations removed."
    }
  },
  "vestal": {
    "flagellant": {
      "affinity": 2,
      "dynamic": "Righteous Fury",
      "description": "The Vestal remembers the tortures the Flagellant inflicted in the Abbey's dungeons, the punisher for her failures. To her, he represented the cruelty of blind devotion—a symbol of what she overcame and now stands against."
    },
    "seraph": {
      "affinity": 7,
      "dynamic": "Awe",
      "description": "Even within the Abbey's walls, Junia heard whispered legends of the Seraph—a warrior-saint burned at the stake who rose transformed by divine fire. Her divine purpose shows the Light's true path."
    }
  },
  "flagellant": {
    "vestal": {
      "affinity": 2,
      "dynamic": "Disdainful Reverence",
      "description": "The Flagellant remembers the Vestal from his time in the Abbey—one who fled her divine retribution rather than embracing sacred suffering. Her strength intrigued him then, but her defiance filled him with scorn and pity."
    }
  },
  "hqclaimants": {
    "kheir": {
      "affinity": 1,
      "dynamic": "Dismissive Scorn",
      "description": "The Claimants cultivated connections with the Heir's father during the Ancestor's gatherings, finding the bloodline useful for their ambitions. The boy himself was hardly worth acknowledging—naive and eager, forever trailing in his father's (and sister's) shadow."
    },
    "heiress": {
      "affinity": 3,
      "dynamic": "Arrogant Derision",
      "description": "The Claimants remember the Heiress as an afterthought at her father's side during courtly functions—sharp-tongued but provincial, a minor irritation easily dismissed while they pursued more valuable connections."
    },
    "duchess": {
      "affinity": 3,
      "dynamic": "Lingering Resentment",
      "description": "The Claimants viewed the Duchess as a social rival whose pride and influence stood in the way of their own ambitions at court."
    },
    "wretch": {
      "affinity": 2,
      "dynamic": "Cruel Satisfaction",
      "description": "The Claimants witnessed the Wretch's fall, finding amusement at the minor noble family's spectacular disgrace. His new life in the sewers only heightens their amusement."
    },
      "psychiatrist": {
      "affinity": 2,
      "dynamic": "Condescending Patronage",
      "description": "The Claimants recall the Therapist as a prestigious but forgettable court employee. His true value was the curious tome they stole from his collection—the very book that guided them to the Estate. To them, the man was merely a means to a much grander end."
    }
  },
  "duchess": {
    "kheir": {
      "affinity": 3,
      "dynamic": "Indifference",
      "description": "In her brief early encounters with the Heir, the Duchess found his adoration amusing but ultimately inconsequential. She does not remember him."
    },
    "heiress": {
      "affinity": 2,
      "dynamic": "Distant Contempt",
      "description": "To the Duchess, the young Heiress was an unremarkable presence, noteworthy only because of her name and connection to the Ancestor. The Duchess has forgotten her."
    },
    "hqclaimants": {
      "affinity": 2,
      "dynamic": "Disdain",
      "description": "The Duchess saw the Claimants as scheming has-beens beneath her station, their fading influence barely worth acknowledging amid her greater rivalry with the Countess."
    }
  },
  "wretch": {
    "hqclaimants": {
      "affinity": 2,
      "dynamic": "Faded Bitterness",
      "description": "The Wretch remembered the Claimants from his days at court—ambitious nobles who embodied everything he once aspired to be. Though the bitterness had long since faded among his rats, their presence is be an uncomfortable reminder of the life he abandoned."
    }
  },
  "seraph": {
    "crusader": {
      "affinity": 4,
      "dynamic": "Fallen Servant",
      "description": "The Seraph valued the Crusader as a capable commander whose devotion to the Light seemed unquestioned. His mercy toward the Warlord and subsequent departure from the crusade marked him as another soul too weak to uphold righteous judgment."
    }
  },
  "psychiatrist": {
    "hqclaimants": {
      "affinity": 2,
      "dynamic": "Analytical Disdain",
      "description": "The Psychiatrist holds a unique contempt for his former employers, whom he found insufferably vain. This professional disdain turned to cold fury when they stole a dangerous tome from his library, and he now sees them as reckless thieves meddling with forces they cannot comprehend."
    }
  }
}