[
  {
    "identifier": "east_district",
    "title": "Eastern District",
    "description": "A maze of salt-worn buildings and creaking boardwalks stretching along the hamlet's waterfront. The harbor's docks extend like broken fingers into the unnaturally dark waters, while abandoned warehouses stand sentinel behind them.",
    "summary": "east_district (Eastern District) -- A maze of salt-worn buildings and creaking boardwalks along the hamlet's waterfront, with docks extending into dark waters and abandoned warehouses.",
    "parent": "hamlet",
    "children": ["harbor", "warehouse_district", "tritonis_house", "yellow_hand", "yellowfinger_house", "kraken_society", "stumbling_corpse", "bathhouse"]
  },
  {
    "identifier": "harbor",
    "title": "Harbor",
    "description": "A stretch of weathered docks extending into waters that seem to swallow light rather than reflect it. Splintered pilings rise like ribs from the dark depths, while rusted chains and frayed ropes mark where ships once moored. The air hangs heavy with salt and decay, disturbed only by the irregular splashing of unseen things beneath the surface.",
    "summary": "harbor (Harbor) -- A stretch of weathered docks extending into dark, light-swallowing waters, marked by splintered pilings and rusted chains.",
    "parent": "east_district",
    "children": ["harbor__pier"]
  },
  {
    "identifier": "harbor__pier",
    "title": "Harbor's Pier",
    "description": "The longest dock reaches deep into the murky waters, its weathered planks perpetually encrusted with barnacles that seem to grow back overnight. At its far end, where chains once held something precious, starfish cluster in unnatural abundance, their forms visible even through the dark waters. Local sailors whisper of a mournful song that rises from the depths during certain moons, and how the last of House Tritonis, mad with grief, walked these boards into the freezing waters in search of their daughter's voice.",
    "summary": "harbor__pier (Harbor's Pier) -- The longest dock reaching into murky waters, known for unnatural starfish clusters and local legends of a mournful song from the depths.",
    "parent": "harbor",
    "children": []
  },
  {
    "identifier": "warehouse_district",
    "title": "Warehouse District",
    "description": "A row of looming structures backing the harbor, their salt-stained walls still bearing faded merchant signs and cargo markings. Most stand empty now, their massive doors sealed by rust and disuse, though some serve as impromptu shelters when the nights grow long. Iron tracks embedded in the cobblestones trace paths from the docks to sealed doorways, speaking of busier days.",
    "summary": "warehouse_district (Warehouse District) -- A row of looming structures backing the harbor, once busy with cargo and now mostly empty, sealed by rust.",
    "parent": "east_district",
    "children": []
  },
  {
    "identifier": "tritonis_house",
    "title": "Tritonis House",
    "description": "A dignified manor perched half over the waters on thick timber supports, its weathered facade still bearing traces of seafoam green paint. Wide windows face the harbor's expanse, while delicate carvings of shells and sea-life adorn the eaves. The house stands empty now, its last inhabitants victims of ambition and the dark waters below.",
    "summary": "tritonis_house (Tritonis House) -- A dignified manor perched over the waters, adorned with sea-life carvings, and once home to the ill-fated House Tritonis.",
    "parent": "east_district",
    "children": ["tritonis_house__daughter_chamber", "tritonis_house__master_bedroom", "tritonis_house__maid_quarter", "tritonis_house__dining_hall", "tritonis_house__porch"]
  },
  {
    "identifier": "tritonis_house__daughter_chamber",
    "title": "Daughter's Chamber",
    "description": "A room frozen in time, its furniture draped in sailcloth that billows in the sea breeze. A vanity holds hairbrushes and ribbons beside a half-written love letter to the Ancestor, its ink long dried. The family portrait above shows a young woman with a starfish woven into her dark hair.",
    "summary": "tritonis_house__daughter_chamber (Daughter's Chamber) -- A room frozen in time within Tritonis House, containing a vanity with personal items and a portrait of a young woman.",
    "parent": "tritonis_house",
    "capacity": 1,
    "children": []
  },
  {
    "identifier": "tritonis_house__master_bedroom",
    "title": "Master Bedroom",
    "description": "Heavy curtains hang motionless over windows facing the pier their daughter loved to dangle her legs from. The bed remains made, as if its owners might return any moment from their final desperate walk into the harbor's depths.",
    "summary": "tritonis_house__master_bedroom (Master Bedroom) -- The main sleeping chamber in Tritonis House, with a made bed and windows overlooking the pier.",
    "parent": "tritonis_house",
    "capacity": 2,
    "children": []
  },
  {
    "identifier": "tritonis_house__maid_quarter",
    "title": "Maid's Quarter",
    "description": "A small but neat room tucked beneath the eaves, its narrow window offering a clear view of the pier below. Dried flowers fill a vase on the simple dresser, maintained by someone's unseen hand.",
    "summary": "tritonis_house__maid_quarter (Maid's Quarter) -- A small, neat room in Tritonis House, tucked beneath the eaves, offering a clear view of the pier.",
    "parent": "tritonis_house",
    "capacity": 1,
    "children": []
  },
  {
    "identifier": "tritonis_house__dining_hall",
    "title": "Dining Hall",
    "description": "Salt-stained paintings of ships line the walls above wainscoting carved with waves. The long table still bears places set for three, their silver tarnished black by years of sea air.",
    "summary": "tritonis_house__dining_hall (Dining Hall) -- A dining hall in Tritonis House, adorned with salt-stained ship paintings and a long table set for three.",
    "parent": "tritonis_house",
    "children": []
  },
  {
    "identifier": "tritonis_house__porch",
    "title": "Harbor Porch",
    "description": "A wraparound veranda suspended over the lapping waters, its railings decorated with intricate nautical knotwork. Weathered chairs face the harbor's expanse, positioned as if their occupants might still watch for returning ships.",
    "summary": "tritonis_house__porch (Harbor Porch) -- A wraparound veranda at Tritonis House, suspended over the waters with nautical knotwork railings, ideal for watching the harbor.",
    "parent": "tritonis_house",
    "children": []
  },
  {
    "identifier": "bathhouse",
    "title": "Bathhouse",
    "description": "A sturdy stone building whose twin chimneys once billowed steam across the harbor. Three large pools occupy the main chamber--one for bathing, two for laundry--their waters now cold and still. The furnace room's copper boilers remain intact but silent. Drainage channels lead to iron grates descending into the sewers below, their edges deeply scored with claw marks. Rats scurry between the torn changing stalls and around the pools.",
    "summary": "bathhouse (Bathhouse) -- A sturdy stone building with three cold pools and silent boilers, its drainage grates leading to rat-infested sewers below.",
    "parent": "east_district",
    "children": []
  },
  {
    "identifier": "yellow_hand",
    "title": "House of the Yellow Hand",
    "description": "A devastated tavern, most of its structure reduced to rubble and rotting timber. Among the debris, a fallen sign bearing a faded golden handprint lies half-buried. Though the building appears thoroughly abandoned, keen observers might notice fresh footprints in the dust leading through a partially cleared path in the wreckage, and occasional whispers seem to emerge from beneath the ruins.",
    "restored": "A three-story establishment of dark timber and wrought iron, its windows glowing amber in the harbor's gloom. The carved sign of a golden hand marks the heavy oak door, while iron-bound stairs lead to private rooms above. Though ostensibly a simple tavern, the regular traffic through its back entrance tells a different story.",
    "summary": "yellow_hand (House of the Yellow Hand) -- A three-story establishment, formerly a tavern, with a golden hand sign, known for private rooms and unusual back-entrance traffic.",
    "parent": "east_district",
    "children": [],
    "npcs": ["smugglers"]
  },
  {
    "identifier": "yellowfinger_house",
    "title": "Yellowfinger Residence",
    "description": "A well-maintained townhouse tucked away in a quiet corner of the harbor district, its windows overlooking both the docks and their ruined tavern. The facade prides itself on its decorative stonework and iron-bound doors. Their black cat Sovereign keeps watch from various windowsills. The cellar entrance, visible only from the back alley, sees frequent midnight traffic. The basement holds room for two, if they can gain Sovereign's favor.",
    "summary": "yellowfinger_house (Yellowfinger Residence) -- A well-maintained townhouse in the harbor district overlooking the docks, with a watchful black cat and a frequented cellar entrance.",
    "parent": "east_district",
    "children": [],
    "capacity": 2,
    "npcs": ["smugglers"]
  },
  {
    "identifier": "kraken_society",
    "title": "The Kraken Society",
    "description": "A shattered building whose jagged silhouette mars the otherwise intact street, its destruction speaking more of calculated malice than mere decay. Rubble resembling thick stone walls, once covered in careful records of the Estate's eldritch monuments, now bear only scorch marks and the occasional fragment of runic script. Inside, broken instruments and burned texts suggest the Ancestor's determination to claim their centuries of research for himself. A partially collapsed staircase spirals down to flooded chambers where the society's most precious archives once resided, though the rising tide has claimed whatever secrets the flames missed.",
    "restored": "A peculiar structure of rough-hewn timber and salvaged stone rises at sharp angles against the harbor sky, betraying its hasty reconstruction. Three asymmetric levels stack precariously, their peaked roofs bristling with makeshift observatories and curious instruments. While the exterior suggests improvised functionality, the interior houses carefully organized archives - newly gathered texts and specimens documenting the Estate's otherworldly elements. The reinstated scholars, like their predecessors, focus particularly on the Red Hook's significance.",
    "summary": "kraken_society (The Kraken Society) -- A peculiar scholarly institution with observatories and instruments, dedicated to documenting the Estate's otherworldly elements and archives.",
    "parent": "east_district",
    "children": []
  },
  {
    "identifier": "stumbling_corpse",
    "title": "The Stumbling Corpse",
    "description": "A weathered boarding house marked by a creaking sign depicting a lurching figure in sailors' garb. Its stone foundation shows signs of recent reinforcement, while the wooden upper floors lean precariously toward the harbor. The proprietor, an aging sailor whose anchor tattoos have faded to a cloudy blue, maintains the establishment with gruff efficiency despite its perpetually listing appearance.",
    "summary": "stumbling_corpse (The Stumbling Corpse) -- A weathered boarding house with a creaking sign, maintained by a gruff sailor, offering lodging near the harbor.",
    "parent": "east_district",
    "children": ["stumbling_corpse__common_room", "stumbling_corpse__captains_berth", "stumbling_corpse__crew_quarters", "stumbling_corpse__keepers_nook"],
    "npcs": ["sailor"]
  },
  {
    "identifier": "stumbling_corpse__common_room",
    "title": "Common Room",
    "description": "A low-ceilinged chamber dominated by a pot-bellied stove and heavy wooden tables bolted to the floor. Nautical charts paper the walls, their edges curling in the damp air, while the proprietor keeps quiet watch from behind a scarred counter, pipe smoke mingling with the ever-present salt air.",
    "summary": "stumbling_corpse__common_room (Common Room) -- A low-ceilinged gathering space in The Stumbling Corpse, dominated by a stove and heavy tables, filled with nautical charts.",
    "parent": "stumbling_corpse",
    "children": []
  },
  {
    "identifier": "stumbling_corpse__captains_berth",
    "title": "Captain's Berth",
    "description": "The largest room, reserved for those who can afford privacy. A brass-framed bed occupies one corner, while a writing desk faces the harbor window. The previous occupant's sextant still rests on the windowsill, undisturbed since they failed to return from their last voyage.",
    "summary": "stumbling_corpse__captains_berth (Captain's Berth) -- The largest, private room in The Stumbling Corpse, with a brass bed and a writing desk overlooking the harbor.",
    "parent": "stumbling_corpse",
    "capacity": 2,
    "children": []
  },
  {
    "identifier": "stumbling_corpse__crew_quarters",
    "title": "Crew Quarters",
    "description": "A long room filled with narrow bunks stacked three high, each with its own sea chest bolted beneath. Rope hammocks hang in the empty spaces, swaying slightly despite the lack of breeze. The wooden walls bear countless carved initials and crude drawings of distant ports.",
    "summary": "stumbling_corpse__crew_quarters (Crew Quarters) -- A long room in The Stumbling Corpse, filled with narrow bunks and sea chests, designed for multiple occupants.",
    "parent": "stumbling_corpse",
    "capacity": 12,
    "children": []
  },
  {
    "identifier": "stumbling_corpse__keepers_nook",
    "title": "Keeper's Nook",
    "description": "The proprietor's private quarters, barely large enough for a bed and standing closet. A collection of pipes lines one wall, while a logbook on the simple desk records decades of tenants, some pages marked with small red crosses.",
    "summary": "stumbling_corpse__keepers_nook (Keeper's Nook) -- The proprietor's private, spartan quarters in The Stumbling Corpse, with a bed, closet, pipes, and a logbook.",
    "parent": "stumbling_corpse",
    "children": []
  }
]