[
  {
    "identifier": "south_district",
    "title": "Southern District",
    "description": "Agricultural land stretches from the hamlet's edge toward the distant Weald. At its heart, the Mill Grounds stand in uneasy balance between salvation and corruption, where townspeople's courage drew new ward lines closer to the comet's impact site. Beyond the wards' protection, the old Apple Yard marks where cultivation gives way to fungal wilderness.",
    "summary": "south_district (Southern District) -- Agricultural land stretching toward the Weald, balancing between the Mill Grounds' salvation and the Apple Yard's fungal wilderness.",
    "parent": "hamlet",
    "children": ["granary", "mill_grounds", "apple_yard", "sanguine_vintners"]
  },
  {
    "identifier": "granary",
    "title": "Granary",
    "description": "A broken husk of splintered timber and collapsing supports that once secured the hamlet's food stores. The loading dock has completely collapsed, leaving wagons' weathered remains half-buried in the debris. Ravens nest in the sagging rafters, their calls echoing through holes in the roof while vermin scurry through rotting grain in the shadows below.",
    "restored": "A sturdy guardian of the hamlet's sustenance risen anew. Fresh-cut timber and iron bands have replaced rotting boards, while the restored loading dock again bears the weight of harvest wagons. The upper floors now keep their precious cargo dry and secure, though workers whisper of strange sounds that still echo from the deepest storage bins.",
    "summary": "granary (Granary) -- A broken husk of splintered timber and rotting grain, serving as a ruined monument to the hamlet's lost sustenance.",
    "parent": "south_district",
    "children": []
  },
  {
    "identifier": "sanguine_vintners",
    "title": "Sanguine Vintners",
    "description": "A collapsed winery whose ruined vats still bear the sickly-sweet smell of fermented harvests past. Broken glass and splintered oak barrels litter the loading dock, while the pressing room's rusted machinery sits frozen in decay. In the cellar, shattered bottles tell tales of desperate looters who found only vinegar and regret.",
    "restored": "An unsettling yet vital facility risen from the old winery's bones. Dark timbers and fresh stonework frame a building that resembles a proper vintner's operation, though its true purpose is betrayed by the corpses of the Courtyard's bloodsuckers visible through leaded windows. Inside, modern distillation apparatus and cooling systems ensure a steady supply of processed blood for the hamlet's cursed residents, while the cellar holds rows of carefully labeled vials rather than wine bottles.",
    "summary": "sanguine_vintners (Sanguine Vintners) -- A collapsed winery reeking of fermentation and decay, now serving darker needs with its ruined vats and shattered bottles.",
    "parent": "south_district",
    "children": []
  },
  {
    "identifier": "mill_grounds",
    "title": "Mill Grounds",
    "description": "A stretch of farmland rescued from deeper corruption when the townspeople moved the Ancestor's ward stones inward, dragging the carved slabs through frozen wheat on creaking carts. Though crystalline growths still pierce the soil and the Miller's towering form stalks these grounds with hostile intent, his presence can be avoided by careful travelers. The new ward line holds just as strong as the original, preventing further corruption from spreading outward from the comet's impact site.",
    "summary": "mill_grounds (Mill Grounds) -- Rescued farmland guarded by shifted ward stones, where crystalline growths and the Miller's shadow mark the edge of safety.",
    "parent": "south_district",
    "children": ["mill", "tainted_well", "miasmal_orchard"],
    "npcs": ["miller_wife"]
  },
  {
    "identifier": "mill",
    "title": "Mill",
    "description": "A stark silhouette of stone and timber whose upper portions hang suspended in defiance of natural law. Crystalline growths trace paths up its walls like frozen ivy, while the great millstone hangs motionless, caught between earthly mechanics and otherworldly forces. Through gaps in the walls, pale blue light pulses in time with distant distortions.",
    "restored": "The great wheel stands whole once more, its timbers and masonry carefully reconstructed to bridge what once floated in cosmic suspension. Though new stones and gears have replaced those too far gone, something of its time in the corruption lingers in the grain's subtle luminescence. The millstone turns again, grinding wheat from safer fields.",
    "summary": "mill (Mill) -- A stark silhouette of stone and timber suspended in defiance of natural law, pulsing with the pale light of distant distortions.",
    "parent": "mill_grounds",
    "children": []
  },
  {
    "identifier": "tainted_well",
    "title": "Tainted Well",
    "description": "A deep-driven shaft whose waters now reflect impossible constellations. The stone walls bear crystalline growths that pulse with inner light, while the well's wooden roof hangs crooked, its beams warped by forces that pull toward the inner wards. No bucket has drawn safe water here since the comet's fall.",
    "restored": "Fresh stones cap the ancient shaft, with new roof timbers replacing those warped by cosmic forces. While the water still glimmers strangely in certain lights, careful filtration and regular testing have made it safe for use once more. The old bucket chain turns true, though workers prefer to draw water in daylight hours.",
    "summary": "tainted_well (Tainted Well) -- A deep-driven shaft where crystalline growths pulse with inner light and the water reflects impossible constellations.",
    "parent": "mill_grounds",
    "children": []
  },
  {
    "identifier": "miasmal_orchard",
    "title": "Miasmal Orchard",
    "description": "Rows of twisted fruit trees transformed by cosmic forces into crystalline mockeries of their former selves. Their branches, more mineral than wood, bear fruit-shaped formations that pulse with inner light. No living thing could find nourishment in this corrupted harvest.",
    "restored": "Patient work has removed the worst of the crystalline growth, while new saplings planted between the old stumps promise future harvests. Though some older trees still bear traces of their corruption in glimmering bark and luminous leaves, their fruit grows wholesome and sweet. The replanted rows stand straight where their twisted predecessors once leaned.",
    "summary": "miasmal_orchard (Miasmal Orchard) -- Rows of twisted trees transformed into crystalline mockeries, bearing mineral fruit that pulses with corrupt light.",
    "parent": "mill_grounds",
    "children": []
  },
  {
    "identifier": "apple_yard",
    "title": "Apple Yard",
    "description": "A small fenced-in piece of land on the Farmstead's southern edge, where the tended fields surrender to the Weald's advance. Twisted apple trees surround a weathered house and listing barn, their branches heavy with bloated fruit that pulses with parasitic life. A woman's mournful wail sometimes echoes across the grounds, begging for release from her fungal-ridden form.",
    "summary": "apple_yard (Apple Yard) -- A fenced enclosure where tended fields surrender to fungal wilderness, haunted by twisted trees and a woman's mournful wail.",
    "parent": "south_district",
    "children": ["apple_yard__house", "apple_yard__barn", "mass_grave"]
  },
  {
    "identifier": "apple_yard__house",
    "title": "Apple Yard House",
    "description": "A sagging two-story home whose rotting walls sprout shelf fungi like hideous decorations. The front door hangs open perpetually, as if still reeling from the last time it was slammed in drunken rage. Through broken windows, the interior's fungal infestation glows with a sickly phosphorescence.",
    "summary": "apple_yard__house (Apple Yard House) -- A sagging home consumed by rot and shelf fungi, where the interior glows with the sickly phosphorescence of infestation.",
    "parent": "apple_yard",
    "children": ["apple_yard__master_bedroom", "apple_yard__mother_room", "apple_yard__daughters_room", "apple_yard__kitchen"]
  },
  {
    "identifier": "apple_yard__master_bedroom",
    "title": "Apple Yard Master Bedroom",
    "description": "A chamber where violence once reigned, now claimed by creeping rot. The bed's splintered headboard bears deep gouges, while dark stains mar the floorboards beneath years of fungal growth. A shattered mirror still clings to one wall, its fragments reflecting nothing but spreading decay.",
    "summary": "apple_yard__master_bedroom (Master Bedroom) -- A chamber of past violence now claimed by creeping rot, featuring a gouged headboard and a mirror reflecting only decay.",
    "parent": "apple_yard__house",
    "children": []
  },
  {
    "identifier": "apple_yard__mother_room",
    "title": "Apple Yard Mother's Room",
    "description": "A narrow space beneath the eaves where fearful whimpers once echoed. Dried flowers fill cracked vases, their stems black with rot, while a small devotional icon lies face-down in the corner. The wallpaper peels away in long strips, revealing flourishing patches of luminescent growth.",
    "summary": "apple_yard__mother_room (Mother's Room) -- A narrow space beneath the eaves where rotted flowers and peeling wallpaper reveal flourishing patches of luminescent growth.",
    "parent": "apple_yard__house",
    "children": []
  },
  {
    "identifier": "apple_yard__daughters_room",
    "title": "Apple Yard Daughter's Chamber",
    "description": "A small room that once held dreams of escape. A tarnished Conscript's pendant hangs beside a cracked mirror, while love letters moldering in a hidden compartment speak of promises never kept. Fungal blooms now trace the path of old tears down the walls, pulsing brighter whenever their former occupant's wails draw near.",
    "summary": "apple_yard__daughters_room (Daughter's Chamber) -- A small room holding moldering love letters and a tarnished pendant, where fungal blooms trace the path of old tears.",
    "parent": "apple_yard__house",
    "children": []
  },
  {
    "identifier": "apple_yard__kitchen",
    "title": "Apple Yard Kitchen",
    "description": "Broken bottles litter the floor around a heavy table scored by pitchfork tines. The hearth stands cold, though something pulses within the chimney's darkness. Shelves still hold preserving jars, their contents now hosting writhing forms that press against the clouded glass.",
    "summary": "apple_yard__kitchen (Kitchen) -- A ruined workspace littered with broken bottles and preserving jars whose contents writhe against the clouded glass.",
    "parent": "apple_yard__house",
    "children": []
  },
  {
    "identifier": "apple_yard__barn",
    "title": "Apple Yard Barn",
    "description": "A listing structure where cattle once sheltered, now a monument to fungal conquest. The hayloft sags beneath masses of twisted growth, while old leather tack sprouts pale mushrooms from every stitch. Something that might once have been a pitchfork stands propped in one corner, its handle fused with the thing that grew around its wielder's grip.",
    "summary": "apple_yard__barn (Apple Yard Barn) -- A listing structure surrendered to fungal conquest, containing sagging haylofts and tools fused by twisted growth.",
    "parent": "apple_yard",
    "children": []
  },
  {
    "identifier": "mass_grave",
    "title": "Mass Grave",
    "description": "A suspiciously regular mound beyond the orchard's edge, where three bodies were said to be buried after the miasma took them. The conscript's sword sticks out of the earth at an odd angle, alongside gifts left by others who pretended to mourn them.",
    "summary": "mass_grave (Mass Grave) -- A suspiciously regular mound marked by a conscript's sword, burying the bodies taken by the miasma.",
    "parent": "apple_yard",
    "children": []
  }
]