[
  {
    "identifier": "west_district",
    "title": "Western District",
    "description": "Centuries past, this was the hamlet's noble quarter, now a hollow echo of former grandeur. The noble house's tower now holds the sanitarium, and with the Weald's miasma it mark this district as a place to avoid. The Caretaker still maintains his provisions, and the Survivalist alone finds comfort beneath the twisted trees.",
    "summary": "west_district (Western District) -- The hamlet's former noble quarter, now characterized by the sanitarium and proximity to the Weald's unsettling influence.",
    "parent": "hamlet",
    "children": ["sanitarium", "provisioner", "survivalist_tent", "weald_edge", "outsider_bonfire", "cartographer_camp"]
  },
  {
    "identifier": "sanitarium",
    "title": "Sanitarium",
    "description": "A repurposed manor house whose noble architecture now serves baser needs. Iron bars cover once-elegant windows, while the central tower rises above like a watchful guardian. Within, grand halls have been converted to wards, and the wine cellar holds patients rather than vintages.",
    "summary": "sanitarium (Sanitarium) -- A repurposed manor house serving as a medical facility, with grand halls converted to wards and a central tower.",
    "parent": "western_district",
    "children": ["sanitarium__tower_study", "sanitarium__treatment_ward", "sanitarium__medical_ward", "sanitarium__laboratorium", "sanitarium__cells", "sanitarium__courtyard", "sanitarium__reception", "sanitarium__nurse_quarters"],
    "npcs": ["nurse", "physician"]
  },
  {
    "identifier": "sanitarium__tower_study",
    "title": "Tower Study",
    "description": "A circular chamber at the tower's peak where leather-bound medical texts share shelf space with older volumes from the building's nobler days. A broad desk faces the window overlooking the Weald's edge, while brass-bound water tanks occupy the floor above, their pipes descending through the ceiling. The doctor's journals lie open beside a brass microscope, their margins filled with increasingly erratic observations.",
    "summary": "sanitarium__tower_study (Tower Study) -- A circular chamber at the sanitarium tower's peak, used for medical study and observation of the Weald's edge.",
    "parent": "sanitarium",
    "children": []
  },
  {
    "identifier": "sanitarium__treatment_ward",
    "title": "Treatment Ward",
    "description": "What was once a grand ballroom now serves as the Physician's domain. Where iron brackets once held privacy screens between patients, elaborate copper and brass apparatus now stand, piping vapors to patients through intricate masks. Colored glass vessels bubble with mysterious concoctions, filling the air with medicinal scents. At the center sits the Physician's workstation, surrounded by jars of dried herbs, powdered minerals, and sealed vials whose contents shimmer unnaturally. The room's high ceiling disappears in a perpetual haze of aromatic smoke, while patients lie in various states of consciousness, their minds being reshaped by the Physician's unorthodox methods.",
    "summary": "sanitarium__treatment_ward (Treatment Ward) -- A grand room in the sanitarium, converted into the Physician's domain, featuring apparatus for unorthodox medical treatments.",
    "parent": "sanitarium",
    "children": []
  },
  {
    "identifier": "sanitarium__medical_ward",
    "title": "Medical Ward",
    "description": "A more orderly space where standard injuries and illnesses are tended, converted from what appears to be a former dining hall. Glass-fronted cabinets hold clearly labeled medicines and bandages, while examination tables occupy curtained alcoves along one wall. The original chandelier still hangs above, its crystal teardrops gathering dust.",
    "summary": "sanitarium__medical_ward (Medical Ward) -- An orderly space in the sanitarium, used for tending standard injuries and illnesses, with labeled medicines and examination tables.",
    "parent": "sanitarium",
    "children": []
  },
  {
    "identifier": "sanitarium__nurse_quarters",
    "title": "Nurse's Quarters",
    "description": "A modest chamber tucked between the wards, where a narrow bed and washing stand occupy one corner while a small desk holds patient records and work schedules. The room's single window looks out on the well in the courtyard below, its casement painted shut against the night air.",
    "summary": "sanitarium__nurse_quarters (Nurse's Quarters) -- A modest chamber in the sanitarium, serving as the nurse's living space and office for patient records.",
    "parent": "sanitarium",
    "children": []
  },
  {
    "identifier": "sanitarium__physician_quarters",
    "title": "Physician's Quarters",
    "description": "A well-established chamber adjoining the Treatment Ward, claimed by the Physician upon her arrival and methodically arranged to her specifications. Heavy curtains of deep crimson block the windows, maintaining the controlled environment her work requires. Bookshelves line one wall, filled with medical tomes whose bindings bear unfamiliar scripts and symbols, now perfectly organized by some system only she comprehends. A permanent laboratory occupies one corner, where glass distillation equipment continuously processes herbs into potent essences. Her personal desk stands opposite her narrow bed, covered with carefully labeled vials and patient notes written in a precise, angular hand. Though impeccably maintained, the room retains a sense of separateness from the rest of the Sanitarium - a distinct territory within Daphne's broader domain.",
    "summary": "sanitarium__physician_quarters (Physician's Quarters) -- A well-established chamber in the sanitarium, serving as the Physician's private living space and laboratory for medical research.",
    "parent": "sanitarium",
    "children": []
  },
  {
    "identifier": "sanitarium__laboratorium",
    "title": "Laboratorium",
    "description": "A long chamber that once served as the house's kitchen, now converted to chemical pursuits. The great hearth still dominates one wall, though it now heats bubbling retorts and mysterious solutions rather than meals. Wooden tables bear the scars of spilled reagents, while the old dumbwaiter now carries specimens between floors instead of dishes.",
    "summary": "sanitarium__laboratorium (Laboratorium) -- A long chamber in the sanitarium, formerly a kitchen, now converted for chemical pursuits with bubbling retorts and mysterious solutions.",
    "parent": "sanitarium",
    "children": []
  },
  {
    "identifier": "sanitarium__cells",
    "title": "Patient Cells",
    "description": "The wine cellar's stone chambers serve new purpose, their thick walls muffling sounds from within. Iron-bound doors have replaced the original oak, while small barred windows admit thin streams of light. The cool air that once preserved vintage wines now carries whispers between cells.",
    "summary": "sanitarium__cells (Patient Cells) -- Stone chambers in the sanitarium's former wine cellar, now used as patient cells with iron-bound doors and barred windows.",
    "parent": "sanitarium",
    "children": [],
    "capacity": 4
  },
  {
    "identifier": "sanitarium__treatment_library",
    "title": "Treatment Library",
    "description": "A compact reference room where medical knowledge resides alongside remedy samples. Modest shelves hold essential texts on surgery, anatomy, and various treatment philosophies, while glass-fronted cabinets display labeled specimens and pharmaceutical samples. A single study table occupies the center, its surface bearing the characteristic stains of medicinal compounds. Smaller than the hamlet's main library, this specialized collection focuses purely on practical healing arts, with texts chosen for utility rather than academic breadth.",
    "summary": "sanitarium__treatment_library (Treatment Library) -- A compact reference room in the sanitarium, holding medical texts, remedy samples, and pharmaceutical specimens for practical healing arts.",
    "parent": "sanitarium",
    "children": []
  },
  {
    "identifier": "sanitarium__courtyard",
    "title": "Courtyard",
    "description": "A walled garden where herbs for both medicine and cooking once grew in orderly beds. The old well still offers clean water, its depth reaching aquifers untainted by the Estate's corruption. Stone benches placed in sunnier spots allow recovering patients their prescribed air, though few stray far from the building's shadow.",
    "summary": "sanitarium__courtyard (Courtyard) -- A walled garden in the sanitarium with an untainted well and stone benches, used for growing herbs and patient recovery.",
    "parent": "sanitarium",
    "children": []
  },
  {
    "identifier": "sanitarium__reception",
    "title": "Reception Hall",
    "description": "The mansion's former entrance hall maintains a pretense of grandeur, though medical notices now cover faded wallpaper and admission records fill cabinets beneath ancestor portraits. A broad desk faces the doors, allowing staff to monitor both arrivals and the stairway leading to upper wards.",
    "summary": "sanitarium__reception (Reception Hall) -- The sanitarium's former mansion entrance, now a reception area with a broad desk for monitoring arrivals and access to upper wards.",
    "parent": "sanitarium",
    "children": []
  },
  {
    "identifier": "provisioner",
    "title": "Provisioner's Store",
    "description": "A cluttered establishment whose organization follows its keeper's fractured logic. Shelves climb the walls in uneven patterns, laden with supplies deemed essential by Grayson's inscrutable criteria. Expedition gear shares space with rusted tools and salvaged oddities, while his endless ledgers fill a corner desk, their margins crowded with prophecies and maintenance schedules.",
    "summary": "provisioner (Provisioner's Store) -- A cluttered establishment organized by its keeper's unique logic, laden with expedition gear, tools, and supplies.",
    "parent": "western_district",
    "children": []
  },
  {
    "identifier": "survivalist_tent",
    "title": "Survivalist's Tent",
    "description": "A sturdy leather pavilion anchored by precisely placed stakes at the settlement's western edge. Maps secured with monster-bone weights cover a makeshift table, their margins marked with observations in Raven's precise hand. Some smaller tents stand nearby, ready for occupants.",
    "summary": "survivalist_tent (Survivalist's Tent) -- A sturdy leather pavilion at the settlement's western edge, used for strategic planning with monster-bone weighted maps.",
    "parent": "western_district",
    "children": [],
    "capacity": 3
  },
  {
    "identifier": "weald_edge",
    "title": "Weald Edge",
    "description": "The ragged border where the hamlet's influence fails against encroaching wilderness. Here, twisted trees lean over crumbling stone walls, their branches tangled with the remnants of old rope from the Gallows Tree. That ancient execution ground still bears its grim fruit, though none can say whether the swaying corpses move from wind or something else. Above the diseased canopy rises the Tall Tree, its uppermost branches lost in mist where the Shrieker's vast nest blocks out the sky. Fungal growths creep closer with each season, their phosphorescent gleam visible through the undergrowth.",
    "summary": "weald_edge (Weald Edge) -- The ragged border where the hamlet meets encroaching wilderness, characterized by twisted trees, ancient execution grounds, and fungal growths.",
    "parent": "western_district",
    "children": []
  },
  {
    "identifier": "outsider_bonfire",
    "title": "Outsider's Bonfire",
    "description": "A scatter of scorched stones and cold ash where the hamlet once celebrated brighter days. Rusted spits and broken benches lie half-buried in weeds, while dark stains mark where revelers spilled their drinks in hasty flight. The old solstice grounds stand empty now, though some say the flames died only after the last celebrant vanished into the Weald's darkness.",
    "restored": "A welcoming circle of warmth and light at the hamlet's edge. Iron spits turn above carefully maintained flames, while sturdy benches and barrels provide comfort for those seeking respite from the Estate's horrors. Though the Weald's shadows press close, they cannot breach the ring of firelight where townsfolk still gather to share meals and memories of better days.",
    "summary": "outsider_bonfire (Outsider's Bonfire) -- A welcoming circle of warmth and light at the hamlet's edge, used for gatherings, sharing meals, and finding respite.",
    "parent": "western_district",
    "children": []
  },
  {
    "identifier": "cartographer_camp",
    "title": "Cartographer's Camp",
    "description": "A collapsed tent whose scattered contents speak of hasty abandonment. Moldering maps poke from muddy earth, their careful markings rendered meaningless by the Estate's shifting geography. A broken theodolite still points toward the manor, its brass dulled by years of neglect.",
    "restored": "A well-ordered pavilion where brass instruments gleam on sturdy tables, dedicated to the endless task of mapping the Estate's fluid boundaries. Fresh charts line the walls, each noting how paths and landmarks drift between surveys. The cartographer works by lamplight into the night, knowing tomorrow's expedition might find everything changed anew.",
    "summary": "cartographer_camp (Cartographer's Camp) -- A well-ordered pavilion with brass instruments and charts, dedicated to mapping the Estate's fluid and shifting boundaries.",
    "parent": "western_district",
    "children": []
  },
  {
    "identifier": "palisade_wall",
    "title": "Palisade Wall",
    "description": "A crude but sturdy barrier of sharpened logs encircling the hamlet's perimeter, erected in haste following the eldritch invasion from the manor. Watchtowers of uneven height punctuate the wall at irregular intervals. Torches flicker in iron brackets, casting shadows across the muddy patrol path. Sections bear the scars of previous assaults—splintered wood hastily reinforced with salvaged furniture, cart wheels, and even tombstones.",
    "summary": "palisade_wall (Palisade Wall) -- A crude but sturdy barrier of sharpened logs and watchtowers, encircling the hamlet's perimeter for defense against invasion.",
    "parent": "west_district",
    "children": []
  }
]