{
  "estateName": "Drammingford",
  "money": 0,
  "month": 0,
  "roles": {
    "margrave": "heiress",
    "bursar": "kheir"
  },
  "characters": {
    "crusader": {
      "identifier": "crusader",
      "title": "Crusader",
      "name": "Reynauld",
      "level": 0,
      "money": 0,
      "description": "Once a simple farmer who joined the war to save his family from famine, Reynauld rose unexpectedly through martial prowess to become a legendary commander. The horrors he witnessed and his own transformation into a hardened warrior left him unable to return to his former life. His peculiar habit of collecting trinkets from fallen enemies and his distinctive whistling became well-known among his men. Now drawn to the Estate, he seeks not holy war but a deeper purpose in combating forces that threaten the very fabric of humanity.",
      "history": "Born to till the soil, Reynauld lived a peaceful life with his wife and young son until famine threatened their survival. He joined the army as a conscript, leaving behind promises of return. His natural leadership and battlefield courage saw him rise from farmer to feared commander. In a pivotal moment, he spared The Warlord, recognizing the futility of endless conflict. This act, coupled with his growing disillusionment, led him to abandon both the war and thoughts of returning home, knowing he could no longer fit into that simple life.",
      "summary": "A stalwart and inspiring former farmer turned legendary Crusader, haunted by war, who struggles with kleptomanic tendencies and a conflicted past.",
      "race": "Human",
      "gender": "Male",
      "religion": "The Light",
      "zodiac": "Leo",
      "traits": [
        "Devoted",
        "Stalwart",
        "Inspiring",
        "Kleptomanic",
        "Conflicted"
      ],
      "status": {
        "physical": 100,
        "mental": 95,
        "affliction": "",
        "description": "Vigilant beneath the Ancestor's statue, spiritually unsettled by the stone eyes that seem to watch with hungry patience",
        "wounds": [],
        "diseases": []
      },
      "stats": {
        "strength": 8,
        "agility": 3,
        "intelligence": 5,
        "authority": 7,
        "sociability": 4
      },
      "equipment": [
        "Holy Sword (family heirloom)",
        "Crusader Armor",
        "Holy Banners",
        "Sacred Scrolls"
      ],
      "appearance": {
        "height": "Tall",
        "build": "Muscular",
        "skinTone": "Fair",
        "hairColor": "Black",
        "hairStyle": "Short",
        "features": "Full beard"
      },
      "clothing": {
        "head": "Steel helm",
        "body": "Chainmail hauberk",
        "legs": "Mail chausses",
        "accessories": "Purple tunic with a white cross"
      },
      "combat": {
        "role": "Warrior",
        "strengths": [
          "Leadership",
          "Endurance",
          "Martial prowess"
        ],
        "weaknesses": [
          "Ranged combat",
          "Speed",
          "Evasion"
        ]
      },
      "magic": "The light, a divine power that lets him smite foes and heal allies",
      "notes": [
        "Has kleptomanic tendencies that he tries to hide",
        "Does a characteristic whistle when pleased with himself",
        "Speaks with archaic formality - uses 'ye,' 'thou,' 'thee,' 'wherefore' in speech",
        "Quietly distrustful of pagans who reject the Light",
        "Wears simple farmer's clothes when out of his armor",
        "Senses spiritual weight in corrupted places",
        "Senses wrongness in the Estate's surrounding lands",
        "Pockets trinkets from fallen enemies with practiced sleight of hand",
        "Deeply unsettled by the Caretaker's madness and cryptic warnings",
        "Senses malevolent awareness in the Ancestor's statue"
      ],
      "tags": [
        "Dancer",
        "Tank",
        "Leader",
        "ShortReach",
        "Healer",
        "UnholyHunter",
        "HeavyHitter",
        "Religious",
        "StressHealer",
        "Stunner",
        "Light",
        "Warrior",
        "Vigilant"
      ],
      "relationships": {
        "heiress": {
          "affinity": 5,
          "dynamic": "Professional",
          "description": "The crusader maintains a professional relationship with the heiress, focusing on fulfilling his role as her protector with a devout sense of duty."
        },
        "kheir": {
          "affinity": 4,
          "dynamic": "Skeptical",
          "description": "The Crusader has pledged to protect the Heir despite obvious doubts about his fitness for the trials ahead. He sees a frightened scholar where leadership is needed, but duty demands he try."
        },
        "highwayman": {
          "affinity": 10,
          "dynamic": "Wary Recognition",
          "description": "The wordless synchronization between them in detecting the ambush confirms a kinship forged in violence—two men who read the same danger signs and move to counter them without needing to speak, their shared martial instincts creating seamless tactical partnership."
        },
        "seraph": {
          "affinity": 4,
          "dynamic": "Devoted Lieutenant",
          "description": "The Crusader served under the Seraph after her miraculous transformation, awed by her divine presence and inspired by her holy purpose. Her burned visage and manifest powers were proof of the Light's grace, making his role in her crusade feel truly righteous."
        }
      },
      "locations": {
        "residence": [
          "dower_house__barracks_room_east"
        ],
        "workplaces": [
          "palisade_wall",
          "guild_hall"
        ],
        "frequents": [
          "dower_house__garden",
          "abbey",
          "town_square",
          "mill_grounds"
        ]
      },
      "strategyWeights": {
        "minimizeLevelHardship": 15,
        "maximizeGameplaySynergy": 1,
        "maximizeAffinity": 3,
        "maximizePeakAffinity": 0,
        "minimizeDiscord": 0,
        "maximizeCommandClarity": 0,
        "minimizeLiabilityExposure": 0,
        "minimizeTacticalNonsense": 0,
        "maximizeDedicatedProtector": 0,
        "balanceAuthority": 0,
        "balanceCondition": 3,
        "maximizeCommandClarity_Heiress": 0,
        "maximizeChildGuardianship_Cook": 0,
        "maximizeSocialVitality_Zenith": 0,
        "minimizeSufferingDisparity_Flagellant": 0,
        "maximizeDedicatedProtector_Martyr": 0,
        "maximizeDedicatedProtector_Offering": 0,
        "maximizeQuarantinedHorrors_Heir": 0
      }
    },
    "highwayman": {
      "identifier": "highwayman",
      "title": "Highwayman",
      "name": "Dismas",
      "level": 0,
      "money": 0,
      "description": "Once a prisoner, the Highwayman is now a haunted fugitive, living off the squalor of the city's canals and the meager pickings from vermin. His vision of freedom has been replaced by a reality of degradation, driving him to reluctantly offer his services for a final, desperate heist. Now, his path has unexpectedly converged with that of the Heiress and the Heir, offering a precarious chance at redemption through service.",
      "history": "The Highwayman's tale is one of escape and survival, painted with strokes of desperation and grim resolve. Escaping from incarceration during a prison riot, he sought refuge in the underbelly of the city, subsisting in conditions that stripped away his illusions of freedom. A final job, taken out of sheer necessity, ended in tragedy, leaving him with a burden of guilt that no distance can alleviate.",
      "summary": "A rugged, desperate, and remorseful Highwayman, haunted by his past as a fugitive, who cheats at cards and possesses a cynical gallows humor.",
      "race": "Human",
      "gender": "Male",
      "religion": "None",
      "zodiac": "Sagittarius",
      "traits": [
        "Rugged",
        "Desperate",
        "Fugitive",
        "Remorseful",
        "Cynical"
      ],
      "status": {
        "physical": 100,
        "mental": 100,
        "affliction": "",
        "description": "Guardedly alert, his cynicism warring with reluctant hope as he watches the Heiress stake her claim",
        "wounds": [],
        "diseases": []
      },
      "stats": {
        "strength": 6,
        "agility": 8,
        "intelligence": 5,
        "authority": 3,
        "sociability": 3
      },
      "equipment": [
        "Flintlock pistol",
        "Dagger"
      ],
      "appearance": {
        "height": "Average",
        "build": "Athletic",
        "skinTone": "Weathered",
        "hairColor": "Dark",
        "hairStyle": "Short, practical",
        "features": "Stubble, narrow face"
      },
      "clothing": {
        "head": "Red scarf",
        "body": "Rugged grey coat with fur collar",
        "legs": "Dark trousers",
        "accessories": "Multiple utility belts"
      },
      "combat": {
        "role": "Skirmisher",
        "strengths": [
          "Quick reflexes",
          "Stealth",
          "Marksmanship"
        ],
        "weaknesses": [
          "Distrustful",
          "Endurance"
        ]
      },
      "magic": "None",
      "notes": [
        "Known to cheat at cards",
        "Has a gallows sense of humor",
        "Carries a tarnished locket taken from a past victim as a reminder of his sins",
        "Recognizes ambush tactics from his own past as a highwayman",
        "Offers comfort to those struggling with violence, perhaps seeking to redeem his own bloody past through small kindnesses",
        "Recognizes brigand tactics intimately, having once been the predator waiting in treelines"
      ],
      "tags": [
        "Dancer",
        "Riposter",
        "Bleeder",
        "Criminal",
        "MarkSynergy",
        "Vigilant",
        "Setup",
        "Outcast",
        "HeavyHitter"
      ],
      "relationships": {
        "heiress": {
          "affinity": 5,
          "dynamic": "Wary Belief",
          "description": "The Heiress's unflinching acceptance of blame and promise to die fighting has cracked his cynicism, though her sincerity worries him more than empty promises would."
        },
        "kheir": {
          "affinity": 4,
          "dynamic": "Gentle Guardian",
          "description": "The Highwayman has begun offering small kindnesses to the trembling Heir, perhaps seeing in the scholar's fear an echo of victims from his own darker days."
        },
        "crusader": {
          "affinity": 10,
          "dynamic": "Battle Brotherhood",
          "description": "The wordless coordination between them in crisis confirms a kinship forged in violence—two men who read the same danger signs and move to counter them without needing to speak, their shared criminal and martial pasts creating an instinctive tactical partnership."
        }
      },
      "locations": {
        "residence": [
          "dower_house__barracks_room_east"
        ],
        "workplaces": [
          "palisade_wall"
        ],
        "frequents": [
          "yellow_hand",
          "alley",
          "town_square",
          "tavern",
          "inn"
        ]
      },
      "strategyWeights": {
        "minimizeLevelHardship": 15,
        "maximizeGameplaySynergy": 1,
        "maximizeAffinity": 3,
        "maximizePeakAffinity": 0,
        "minimizeDiscord": 0,
        "maximizeCommandClarity": 0,
        "minimizeLiabilityExposure": 0,
        "minimizeTacticalNonsense": 0,
        "maximizeDedicatedProtector": 0,
        "balanceAuthority": 0,
        "balanceCondition": 3,
        "maximizeCommandClarity_Heiress": 0,
        "maximizeChildGuardianship_Cook": 0,
        "maximizeSocialVitality_Zenith": 0,
        "minimizeSufferingDisparity_Flagellant": 0,
        "maximizeDedicatedProtector_Martyr": 0,
        "maximizeDedicatedProtector_Offering": 0,
        "maximizeQuarantinedHorrors_Heir": 0
      }
    },
    "heiress": {
      "identifier": "heiress",
      "title": "Heiress",
      "name": "Persephone",
      "level": 0,
      "money": 0,
      "description": "The Heiress to the accursed Estate, excels at taking command in even the most daunting situations. With her sharp intellect and strategic prowess, she fearlessly leads the charge to reclaim her ancestral home while deftly managing the nearby hamlet. Her natural authority and decisive leadership serve as a beacon of strength for a community besieged by supernatural horrors. Though grateful for allies brave enough to join her cause, Persephone's unwavering confidence in her own judgment can manifest as stubborn resistance when her authority is challenged.",
      "history": "Upon receiving a chilling letter from her late ancestor, the Heiress left her academic pursuits with her brother in tow to take up her role as the Heiress of the Estate. She found herself thrust into a nightmarish reality where her ancestral home was not only physically deteriorated but also infested with the horrors summoned by her ancestor's dark rituals.",
      "summary": "The decisive Heiress, a strategic and authoritative leader who struggles with stubbornness and anxiety about losing control, often resorting to wine.",
      "race": "Human",
      "gender": "Female",
      "religion": "None",
      "zodiac": "Leo",
      "traits": [
        "Determined",
        "Resourceful",
        "Strategic",
        "Intelligent",
        "Stubborn",
        "Authoritative"
      ],
      "status": {
        "physical": 65,
        "mental": 100,
        "affliction": "",
        "description": "Resolute and commanding despite her wounds, drawing strength from the weight of public declaration",
        "wounds": [
          "Cut on left cheekbone (will scar)"
        ],
        "diseases": []
      },
      "stats": {
        "strength": 2,
        "agility": 3,
        "intelligence": 8,
        "authority": 10,
        "sociability": 9
      },
      "equipment": [
        "Derringer pistol",
        "wine bottle"
      ],
      "appearance": {
        "height": "Average",
        "build": "Average",
        "skinTone": "Fair",
        "hairColor": "Blond",
        "hairStyle": "Tied up in a bun and with curly bangs",
        "features": "Strong jawline and pointy nose"
      },
      "clothing": {
        "head": "Hair needle",
        "body": "Marine blue robe over white shirt",
        "legs": "Mustard yellow breeches",
        "accessories": "White bowtie"
      },
      "combat": {
        "role": "Leader",
        "strengths": [
          "Quick reflexes",
          "Sharpshooting",
          "Strategic thinking"
        ],
        "weaknesses": [
          "Close combat",
          "Physical strength"
        ]
      },
      "magic": "None",
      "notes": [
        "Turns to wine when overwhelmed by stress",
        "Attracted to, and can't help staring at, women with ample breasts",
        "Scared of losing her authority, she meets those challenging it by becoming more commanding and inflexible.",
        "Responds to sexualized threats with cold, controlled violence rather than visible distress",
        "Refuses to let others tend her wounds, wearing injuries as proof of survival",
        "Wears her wounds publicly as proof of commitment, refusing to appear untouched by hardship"
      ],
      "tags": [
        "Backline",
        "Healer",
        "StressHealer",
        "Blighter",
        "Marker",
        "MarkSynergy",
        "Debuffer",
        "Abrasive",
        "Noble",
        "Leader",
        "Drunkard",
        "Vigilant",
        "Weak",
        "Frail",
        "Strategist",
        "Scavenger"
      ],
      "strategyWeights": {
        "minimizeLevelHardship": 15,
        "maximizeGameplaySynergy": 1,
        "maximizeAffinity": 3,
        "maximizePeakAffinity": 0,
        "minimizeDiscord": 3,
        "maximizeCommandClarity": 0,
        "minimizeLiabilityExposure": 6.5,
        "minimizeTacticalNonsense": 3,
        "maximizeDedicatedProtector": 0,
        "balanceAuthority": 0,
        "balanceCondition": 3,
        "maximizeCommandClarity_Heiress": 10,
        "maximizeChildGuardianship_Cook": 0,
        "maximizeSocialVitality_Zenith": 0,
        "minimizeSufferingDisparity_Flagellant": 0,
        "maximizeDedicatedProtector_Martyr": 0,
        "maximizeDedicatedProtector_Offering": 0,
        "maximizeQuarantinedHorrors_Heir": 0
      },
      "relationships": {
        "kheir": {
          "affinity": 6,
          "dynamic": "Contemptuous Protector",
          "description": "The Heiress's protective instincts toward her brother have curdled into open contempt, her frustration with his visible cowardice manifesting as cutting public humiliation even as she shields him from harm."
        },
        "crusader": {
          "affinity": 5,
          "dynamic": "Professional",
          "description": "The heiress maintains a reserved, professional demeanor towards the crusader, her latest recruit."
        },
        "highwayman": {
          "affinity": 4,
          "dynamic": "Guarded Pragmatism",
          "description": "The Heiress recognizes the Highwayman's value as a skilled fighter and tracker, though his criminal background requires she remain watchful. She hired him for competence, not trustworthiness."
        },
        "hqclaimants": {
          "affinity": 2,
          "dynamic": "Contemptuous Competitors",
          "description": "The Heiress saw the Claimants as vain and insufferable during their fleeting courtly encounters. Their thinly veiled insults ensured no love was lost between them."
        },
        "duchess": {
          "affinity": 3,
          "dynamic": "Cautious Disdain",
          "description": "The Heiress remembers the Duchess as aloof and self-absorbed during the few balls they attended together. Though she barely knew her, the Duchess's pride left a sour impression."
        }
      },
      "locations": {
        "residence": [
          "dower_house__master_bedroom"
        ],
        "workplaces": [
          "town_hall__strategy_room",
          "dower_house__study",
          "town_hall__meeting_hall",
          "town_hall__council_chamber"
        ],
        "frequents": [
          "tavern",
          "dower_house__wine_cellar",
          "dower_house__garden",
          "dower_house__red_hook",
          "town_square"
        ]
      }
    },
    "kheir": {
      "identifier": "kheir",
      "title": "Heir",
      "name": "Percival",
      "level": 0,
      "money": 0,
      "description": "The Heir to the estate is a brilliant scholar and capable manager who is trying to cope in this world of horrors far beyond his comfort. Despite his meek nature, Percival's keen intellect and organizational skills prove invaluable in coordinating the chaotic efforts to reclaim his ancestral home. Though he prefers the map room, he, armed with a letter opener, reluctantly ventures into the dungeons when the quest demands it, determined to live up to the expectations of his Sister and their family name.",
      "history": "Raised in academic circles far from the estate's dark legacy, Percival initially resisted his sister's summons. However, his sense of duty—and intellectual curiosity—ultimately drew him to the task. While he makes no pretense of physical courage, he is the backbone of the estate's logistics, handling its people with the same ease he manages its resources.",
      "summary": "The meek, cowardly Heir, a brilliant scholar with a drinking problem, who struggles to cope with horrors and is very possessive of his belongings.",
      "race": "Human",
      "gender": "Male",
      "religion": "None",
      "zodiac": "Virgo",
      "traits": [
        "Organized",
        "Cowardly",
        "Scholarly",
        "Anxious",
        "Resourceful"
      ],
      "status": {
        "physical": 77,
        "mental": 15,
        "affliction": "",
        "description": "Nauseated by the weight of his sister's declarations that include him, feeling like a fraud beside her commanding presence",
        "wounds": [],
        "diseases": []
      },
      "stats": {
        "strength": 2,
        "agility": 2,
        "intelligence": 9,
        "authority": 6,
        "sociability": 8
      },
      "equipment": [
        "Letter opener",
        "Wine bottle"
      ],
      "appearance": {
        "height": "Short",
        "build": "Chubby",
        "skinTone": "Fair",
        "hairColor": "Blond",
        "hairStyle": "Curled and styled",
        "features": "Large nose and round face"
      },
      "clothing": {
        "head": "None",
        "body": "Well-tailored jacket and waistcoat",
        "legs": "Mustard yellow breeches",
        "accessories": "Bowtie"
      },
      "combat": {
        "role": "Support Tactician",
        "strengths": [
          "Strategic planning",
          "Resource management",
          "Knowledge application"
        ],
        "weaknesses": [
          "Close combat",
          "Endurance",
          "Doesn't work well under pressure"
        ]
      },
      "magic": "None",
      "notes": [
        "Obsessively protective of his personal belongings.",
        "Has a penchant for fine wines to calm his nerves.",
        "Can be argumentative and sharp when in his element, but becomes quieter and withdrawn when frightened.",
        "Harbors shameful satisfaction when his sister suffers, a dark impulse that disgusts him",
        "Silently resents being included in promises he doubts he can keep"
      ],
      "tags": [
        "Flexible",
        "Weak",
        "Frail",
        "Healer",
        "StressHealer",
        "Blighter",
        "Debuffer",
        "Noble",
        "Scholar",
        "Strategist",
        "Drunkard",
        "SelfStress",
        "Scavenger"
      ],
      "relationships": {
        "heiress": {
          "affinity": 3,
          "dynamic": "Resentful Dependence",
          "description": "His sister's bold declarations on his behalf deepen his sense of inadequacy, breeding quiet resentment even as he remains utterly reliant on her leadership."
        },
        "crusader": {
          "affinity": 4,
          "dynamic": "Nervous Reliance",
          "description": "The Heir is intimidated by the Crusader's imposing presence and martial bearing, but finds some comfort in having such a formidable protector."
        },
        "highwayman": {
          "affinity": 6,
          "dynamic": "Grateful Refuge",
          "description": "The Highwayman's steady presence offers the Heir a rare kindness amid his terror, becoming an unlikely source of comfort that his own sister fails to provide."
        },
        "hqclaimants": {
          "affinity": 2,
          "dynamic": "Aristocratic Rivalry",
          "description": "The Claimants' constant disdain and biting remarks left a lasting impression on the Heir during the balls and duels of their youth. The Heir remains embittered but grudgingly acknowledges The Claimant brother's skill with a spear."
        },
        "duchess": {
          "affinity": 5,
          "dynamic": "Infatuation",
          "description": "As a young man, the Heir was captivated by the Duchess' elegance and fencing prowess. Though their interactions were brief and unreciprocated, her image lingered in his mind for years."
        }
      },
      "locations": {
        "residence": [
          "dower_house__master_bedroom"
        ],
        "workplaces": [
          "town_hall__strong_room",
          "provisioner"
        ],
        "frequents": [
          "dower_house__astronomy_room",
          "tavern",
          "dower_house__garden",
          "dower_house__wine_cellar",
          "library__main"
        ]
      },
      "strategyWeights": {
        "minimizeLevelHardship": 15,
        "maximizeGameplaySynergy": 1,
        "maximizeAffinity": 3,
        "maximizePeakAffinity": 0,
        "minimizeDiscord": 0,
        "maximizeCommandClarity": 0,
        "minimizeLiabilityExposure": 0,
        "minimizeTacticalNonsense": 0,
        "maximizeDedicatedProtector": 0,
        "balanceAuthority": 0,
        "balanceCondition": 3,
        "maximizeCommandClarity_Heiress": 0,
        "maximizeChildGuardianship_Cook": 0,
        "maximizeSocialVitality_Zenith": 0,
        "minimizeSufferingDisparity_Flagellant": 0,
        "maximizeDedicatedProtector_Martyr": 0,
        "maximizeDedicatedProtector_Offering": 0,
        "maximizeQuarantinedHorrors_Heir": 0
      }
    }
  },
  "characterLogs": {
    "kheir": [
      {
        "month": 0,
        "entry": "Arrived at the ancestral hamlet for the first time, confronting the grim reality of his inheritance.",
        "expiryMonth": 3
      }
    ],
    "heiress": [
      {
        "month": 0,
        "entry": "Publicly accepted responsibility for the ancestral sins that devastated the hamlet, pledging to fight or die alongside its people.",
        "expiryMonth": 7
      }
    ]
  },
  "estateLogs": [
    {
      "month": 0,
      "entry": "The party traveled by stagecoach through the oppressive Weald toward the ancestral estate, tensions simmering beneath nervous conversation.",
      "expiryMonth": 1
    },
    {
      "month": 0,
      "entry": "The carriage crashed in the woods, leaving the party stranded. The driver and horses vanished without trace, forcing the group to proceed on foot toward the hamlet.",
      "expiryMonth": 1
    },
    {
      "month": 0,
      "entry": "A cutthroat brigand emerged to block the party's path after their stagecoach was overturned, threatening violence while his unseen allies lurked in the treeline.",
      "expiryMonth": 1
    },
    {
      "month": 0,
      "entry": "The party discovered a ransacked merchant camp with days-old corpses before being confronted by two brigands—a scarred giant with a cat o' nine tails and a hooded man with a blunderbuss—blocking the road to the hamlet.",
      "expiryMonth": 1
    },
    {
      "month": 0,
      "entry": "The party arrived at the hamlet after surviving the brigand ambush, where the Caretaker awaited them with the stagecoach, speaking cryptically of the Estate's awareness of their coming.",
      "expiryMonth": 3
    },
    {
      "month": 0,
      "entry": "The Drammingford heirs publicly announced their arrival to the hamlet, with Persephone claiming responsibility for their ancestor's sins and pledging to fight alongside the townsfolk.",
      "expiryMonth": 3
    }
  ]
}