{
    "identifier": "lady",
    "title": "Lady",
    "name": "Adelaide",
    "summary": "The daughter of a neighboring farm family who found herself wed to Jeremiah as part of an arrangement to consolidate land holdings. Adelaide's initial reluctance gave way to a functional partnership as they managed the region's agriculture together. Since discovering the black meat, however, her body has begun to swell with both corruption and what she believes to be child. Her form grows distorted, with patches of skin mysteriously missing from her arms and shoulders - wounds she covers with elegant shawls and attributes to a skin condition.",
    "history": "Adelaide was promised to Jeremiah when his rising fortunes made him the most powerful farmer in the region, her family hoping to benefit from the alliance. For years they lived as an ordinary, if ambitious, farming couple, working together to expand their holdings after the Ancestor's neglect. Their elevation to nobility brought new pressures but also opportunities. Everything changed with the first taste of Black Phillip's meat. While Jeremiah's hunger grew outward, Adelaide's turned inward, convincing her that the swelling of her abdomen signals a child rather than corruption. Now she endures his increasingly violent outbursts and occasional hunger-driven bites with placid acceptance, finding joy in preparing for what she believes is their coming child.",
    "traits": [
      "Acquiescent",
      "Nurturing",
      "Welcoming"
    ],
    "appearance": {
      "height": "Average",
      "build": "Swollen and misshapen",
      "skinTone": "Pale with irregular patches missing",
      "hairColor": "Honey blonde",
      "hairStyle": "Elaborate updo hiding missing patches of scalp",
      "features": "Distant smile, glazed eyes"
    },
    "clothing": {
      "head": "Lace cap with long ribbons",
      "body": "Overly formal gown with high collar and long sleeves",
      "legs": "Multiple layered skirts hiding her distorted lower half",
      "accessories": "Decorative shawls strategically placed to cover wounds"
    },
    "notes": [
      "Meticulously wipes her mouth with a handkerchief after each bite",
      "Speaks affectionately about her 'little one' to confused guests"
    ]
  }