[
  {
    "identifier": "brigand_cutthroat",
    "title": "Brigand Cutthroat",
    "faction": ["Brigand"],
    "description": "The Cutthroat is the sharp, merciless edge of the brigand ranks. A master of ambush and sudden violence, he haunts the Old Road and its surrounding thickets, waiting for the instant a traveler’s guard falters. He does not seek a fair fight—only a decisive one—darting through chaos with twin daggers to open arteries and vanish before reprisal can find him.",
    "history": "Most Cutthroats are drawn from the desperate and the dispossessed: deserters, failed footpads, and men who learned early that subtlety keeps one alive longer than courage. Within brigand bands, they are valued not for loyalty or leadership, but for their reliability in bloodshed. Where others hesitate, the Cutthroat strikes.",
    "summary": "A lethal skirmisher who excels at ambush tactics and close-quarters bleeding attacks, relying on speed and precision rather than endurance.",
    "race": "Human",
    "gender": "Male",
    "religion": "Pagan",
    "traits": [
      "Opportunistic",
      "Precise",
      "Ruthless",
      "Agile"
    ],
    "stats": {
      "strength": 7,
      "agility": 9,
      "intelligence": 4,
      "authority": 2,
      "sociability": 3
    },
    "equipment": [
      "Twin daggers"
    ],
    "appearance": {
      "height": "Tall",
      "build": "Athletic",
      "skinTone": "Dark",
      "hairColor": "Unknown",
      "hairStyle": "Hidden",
      "features": "A notably large, crooked nose and cold, predatory eyes"
    },
    "clothing": {
      "head": "Green hood that partially obscures a stubbled face",
      "body": "Reinforced thick gambeson",
      "legs": "Hardy green breeches",
      "accessories": "Tan padded vest and leather utility straps"
    },
    "combat": {
      "role": "Close combat",
      "strengths": [
        "High critical precision",
        "Exceptional mobility"
      ],
      "weaknesses": [
        "Low physical endurance",
        "Ineffective at range"
      ]
    },
    "magic": "None"
  },
  {
    "identifier": "brigand_fusilier",
    "title": "Brigand Fusilier",
    "faction": ["Brigand"],
    "description": "The Fusilier brings the thunder of black powder to the brigand trade. Though lacking the discipline of a true marksman, he compensates with the brutal efficiency of his blunderbuss, scattering shot and smoke alike to shatter formations and morale. His presence turns skirmishes into chaos, filling the air with choking powder and the promise of indiscriminate destruction.",
    "history": "Many Fusiliers were once powder-monkeys, watchmen, or militiamen who discovered that firearms yield greater profit when freed from law and restraint. They tend their weapons with near-superstitious care, believing the roar of the gun to be both shield and threat—a sound that wards off enemies mundane and otherwise.",
    "summary": "A disruptive backline combatant who uses black powder weaponry to inflict area damage, suppress foes, and sow panic.",
    "race": "Human",
    "gender": "Male",
    "religion": "Pagan",
    "traits": [
      "Vigilant",
      "Noisy",
      "Destructive"
    ],
    "stats": {
      "strength": 4,
      "agility": 7,
      "intelligence": 5,
      "authority": 1,
      "sociability": 6
    },
    "equipment": [
      "Blunderbuss"
    ],
    "appearance": {
      "height": "Average",
      "build": "Lean",
      "skinTone": "Tan",
      "hairColor": "Unknown",
      "hairStyle": "Hidden",
      "features": "Soot-stained skin and squinted eyes from years of muzzle flashes"
    },
    "clothing": {
      "head": "Green hood pulled low",
      "body": "Rugged linen shirt",
      "legs": "Brown canvas trousers",
      "accessories": "Green cloak, tan padded vest, and a scorched gunpowder pouch"
    },
    "combat": {
      "role": "Suppressive Marksman",
      "strengths": [
        "Crowd control",
        "Rapid fire"
      ],
      "weaknesses": [
        "Vulnerable in melee",
        "Poor individual accuracy"
      ]
    },
    "magic": "None"
  },
  {
    "identifier": "brigand_blood",
    "title": "Brigand Bloodletter",
    "faction": ["Brigand"],
    "description": "The Bloodletter is the iron fist of the brigand gangs—a towering brute who rules through visceral terror. He wields pain as both weapon and language, his cat o’ nine tails cracking flesh and will in equal measure. On the battlefield, he advances without haste, absorbing punishment as he lashes out, breaking bodies and spirits alike.",
    "history": "Bloodletters are most often former pit-fighters, executioners, or men who learned to equate dominance with survival. Few brigands willingly challenge one; fewer still survive doing so. Within larger gangs, the Bloodletter’s authority is absolute—not because it is granted, but because it is enforced.",
    "summary": "A massive frontline enforcer who controls the battlefield through intimidation, raw physical durability, and relentless close-range pressure.",
    "race": "Human",
    "gender": "Male",
    "religion": "Pagan",
    "traits": [
      "Sadistic",
      "Imposing",
      "Authoritative",
      "Thick-skinned"
    ],
    "stats": {
      "strength": 10,
      "agility": 3,
      "intelligence": 3,
      "authority": 9,
      "sociability": 2
    },
    "equipment": [
      "Cat o' nine tails whip",
      "Heavy flintlock pistol"
    ],
    "appearance": {
      "height": "Massive",
      "build": "Hulking and Muscular",
      "skinTone": "Dark",
      "hairColor": "None",
      "hairStyle": "Bald",
      "features": "A map of jagged battle scars across his torso and back, and a split lip"
    },
    "clothing": {
      "head": "Green hood obscuring a scarred face",
      "body": "Bare, scarred chest",
      "legs": "Blood-stained green pants",
      "accessories": "Spiked iron bracelets, large golden necklace, and two heavy leather belts"
    },
    "combat": {
      "role": "Frontline Enforcer",
      "strengths": [
        "Extreme physical durability",
        "Crowd intimidation"
      ],
      "weaknesses": [
        "Slow movements",
        "Low tactical flexibility"
      ]
    },
    "magic": "None"
  }
]
