{
  "identifier": "crusader",
  "title": "Crusader",
  "name": "Reynauld",
  "level": 0,
  "money": 0,
  "description": "Once a simple farmer who joined the war to save his family from famine, Reynauld rose unexpectedly through martial prowess to become a legendary commander. The horrors he witnessed and his own transformation into a hardened warrior left him unable to return to his former life. His peculiar habit of collecting trinkets from fallen enemies and his distinctive whistling became well-known among his men. Now drawn to the Estate, he seeks not holy war but a deeper purpose in combating forces that threaten the very fabric of humanity.",
  "history": "Born to till the soil, Reynauld lived a peaceful life with his wife and young son until famine threatened their survival. He joined the army as a conscript, leaving behind promises of return. His natural leadership and battlefield courage saw him rise from farmer to feared commander. In a pivotal moment, he spared The Warlord, recognizing the futility of endless conflict. This act, coupled with his growing disillusionment, led him to abandon both the war and thoughts of returning home, knowing he could no longer fit into that simple life.",
  "summary": "A stalwart and inspiring former farmer turned legendary Crusader, haunted by war, who struggles with kleptomanic tendencies and a conflicted past.",
  "race": "Human",
  "gender": "Male",
  "religion": "The Light",
  "zodiac": "Leo",
  "traits": [
    "Devoted",
    "Stalwart",
    "Inspiring",
    "Kleptomanic",
    "Conflicted"
  ],
  "status": {
    "physical": 100,
    "mental": 100,
    "affliction": "",
    "description": "In good health and high spitits",
    "wounds": [],
    "diseases": []
  },
  "stats": {
    "strength": 8,
    "agility": 3,
    "intelligence": 5,
    "authority": 7,
    "sociability": 4
  },
  "equipment": [
    "Holy Sword (family heirloom)",
    "Crusader Armor",
    "Holy Banners",
    "Sacred Scrolls"
  ],
  "appearance": {
    "height": "Tall",
    "build": "Muscular",
    "skinTone": "Fair",
    "hairColor": "Black",
    "hairStyle": "Short",
    "features": "Full beard"
  },
  "clothing": {
    "head": "Steel helm",
    "body": "Chainmail hauberk",
    "legs": "Mail chausses",
    "accessories": "Purple tunic with a white cross"
  },
  "combat": {
    "role": "Warrior",
    "strengths": [
      "Leadership",
      "Endurance",
      "Martial prowess"
    ],
    "weaknesses": [
      "Ranged combat",
      "Speed",
      "Evasion"
    ]
  },
  "magic": "The light, a divine power that lets him smite foes and heal allies",
  "notes": [
    "Has kleptomanic tendencies that he tries to hide",
    "Does a characteristic whistle when pleased with himself",
    "Speaks with archaic pronouns such as 'ye,' 'thou,' and 'thee' in speech",
    "Quietly distrustful of pagans who reject the Light",
    "Wears simple farmer's clothes when out of his armor",
    "Used to carve wood toys for his son"
  ],
  "tags": [
    "Dancer", "Tank", "Leader", "ShortReach", "Healer", "UnholyHunter", "HeavyHitter",
    "Religious", "StressHealer", "Stunner", "Light", "Warrior", "Vigilant"
  ],
  "relationships": {
  }
}