{
  "identifier": "duchess",
  "title": "Duchess",
  "name": "Constance",
  "level": 0,
  "money": 0,
  "description": "The Duchess is a bloodsucker noble who wears her curse with aristocratic pride. Once a refined noblewoman and the court's finest fencer, she was transformed when she unknowingly drank wine laced with the Countess's blood at one of the Ancestor's parties. The curse crystallized her defining trait—an unshakeable conviction of her own superiority and her rivalry with the Countess. Exiled from the Crimson Court while her rival sits on the throne, she now seeks to use the Hamlet's forces as pawns in her vendetta. She wields an enormous greatsword and can transform into a massive, bestial form when her hunger overwhelms her control. The hunger never leaves, but she refuses to let something so vulgar compromise her dignity.",
  "history": "The Duchess and the Countess were bitter rivals whose competition was the stuff of legend. At the Ancestor's final debauch, the guests unwittingly drank wine laced with the Countess's blood, transforming into monsters that reflected their truest natures. For the Duchess, this manifestation was one of crystallized pride. While the court fell into mindless hedonism, the Duchess—along with the Baron, Viscount, and Countess—retained her cunning, vying for dominion over their festering domain. Ultimately outmaneuvered and cast out to the connected Hamlet, she immediately found opportunity in their feeble quest to cleanse the Estate, Courtyard included. She would pretend to assist them, maneuvering them pawns toward her true goal: not to cleanse, but to usurp the Countess.",
  "race": "Bloodsucker",
  "gender": "Female",
  "religion": "None",
  "zodiac": "Libra",
  "traits": [
    "Refined",
    "Prideful",
    "Ravenous",
    "Vengeful",
    "Imperious",
    "Ruthless"
  ],
    "status": {
    "physical": 100,
    "mental": 100,
    "affliction": "",
    "description": "In good health and high spirits",
    "wounds": [],
    "diseases": []
  },
  "stats": {
    "strength": 9,
    "agility": 6,
    "intelligence": 7,
    "authority": 7,
    "sociability": 5
  },
  "equipment": [
    "'Joyeuse' (Enormous greatsword)"
  ],
  "appearance": {
    "height": "Tall",
    "build": "Athletic",
    "skinTone": "Pale gray",
    "hairColor": "Dark red (hidden)",
    "hairStyle": "Short and messy (hidden)",
    "features": "Huge breasts"
  },
  "clothing": {
    "head": "Large, angular helmet that hides everything but her toothy mouth",
    "body": "Tight corset showing ample cleavage",
    "legs": "Tattered dress reinforced with metal plates",
    "accessories": "None"
  },
  "combat": {
    "role": "Melee Fighter",
    "strengths": [
      "Peerless fencer",
      "Beast transformation",
      "Resilient"
    ],
    "weaknesses": [
      "Driven by insatiable hunger",
      "Easily loses control",
      "Unsettles teammates"
    ]
  },
  "magic": "Crimson Curse transformation",
  "notes": [
    "Maintains an aristocratic air, insisting on comforts befitting her station",
    "Treats her hunger with dark humor, often joking about eating her allies",
    "Calls people 'dear' condescendingly and uses very formal language",
    "Loses all control when her hunger becomes overwhelming, speaking in furious screams and attacking indiscriminately",
    "Her helmet is unremovable and covers her eyes, yet she can still perceive the world"
  ],
  "tags": [
    "Frontline", "Riposter", "Shapeshifter", "SelfSufficient", "Debuffer", "Stunner", "HeavyHitter", "Duchess",
    "Setup", "Crit", "SelfStress", "Noble", "Warrior", "Unstable", "Outcast", "Eldritch"
  ],
  "relationships": {
  }
}