{
  "identifier": "greymane",
  "title": "Cursed",
  "name": "Genn Greymane",
  "level": 0,
  "money": 0,
  "description": "The proud and tragic King of Gilneas, the Cursed is a man defined by his failures and his unbreakable will to atone. He wields the very lycanthropic curse that ruined his kingdom as a weapon, shifting between a pragmatic human commander and a ferocious Worgen beast. Driven by the ghosts of his past, he has come to the Estate to prove that even a fallen king can still protect his people and carve out a future from ruin.",
  "history": "Once an arrogant and isolationist ruler, the Cursed's pride led to the downfall of his kingdom, Gilneas. In a desperate act to defend his walled-off nation, he unleashed the Worgen curse, only to see it infect him and his people, costing him his son and his throne. Now a king without a country, he is haunted by his choices and seeks not conquest, but redemption, fighting to restore the honor of his name and the future of the Gilnean people.",
  "summary": "A proud and tragic cursed king who wields his monstrous form as a weapon, haunted by past failures and driven by a desperate need for atonement.",
  "race": "Human",
  "gender": "Male",
  "religion": "The Light",
  "zodiac": "Leo",
  "traits": [
    "Proud",
    "Determined",
    "Pragmatic",
    "Regretful",
    "Volatile",
    "Authoritative"
  ],
  "status": {
    "physical": 100,
    "mental": 100,
    "affliction": "",
    "description": "In good health and high spitits",
    "wounds": [],
    "diseases": []
  },
  "stats": {
    "strength": 8,
    "agility": 7,
    "intelligence": 6,
    "authority": 9,
    "sociability": 3
  },
  "equipment": [
    "Flintlock pistol",
    "King's Saber"
  ],
  "appearance": {
    "height": "Tall",
    "build": "Sturdy",
    "skinTone": "Weathered",
    "hairColor": "White",
    "hairStyle": "Thick and swept back",
    "features": "Full white beard and mutton chops, sharp facial scars"
  },
  "clothing": {
    "head": "None",
    "body": "Black greatcoat with gold epaulets",
    "legs": "Dark trousers",
    "accessories": "Red cravat"
  },
  "combat": {
    "role": "Shapeshifting Brawler",
    "strengths": [
      "Versatile (Human/Worgen forms)",
      "High damage output",
      "Controlled ferocity"
    ],
    "weaknesses": [
      "Prideful arrogance",
      "Vulnerable to bloodlust",
      "Can become abusive under stress"
    ]
  },
  "magic": "The Worgen Curse, allowing him to shapeshift at will between his human and bestial forms.",
  "notes": [
    "Haunted by the memory of his lost son, Liam, and the fall of his kingdom.",
    "Maintains rigid control over his Worgen form, but the scent of blood can agitate his inner beast.",
    "Carries immense guilt over his past pride and isolationism, which he now views as the cause of his people's suffering.",
    "Has a grim, cynical sense of humor, often joking about his own curse."
  ],
  "relationships": {}
}