{
  "identifier": "jester",
  "title": "Jester",
  "name": "Sarmenti",
  "level": 0,
  "money": 0,
  "description": "Once a wandering street musician who fell prey to an otherworldly melody, the Jester now combines deadly precision with musical talent. Though appearing as a mere entertainer, he harbors dark experiences from his past that fuel both his performances and his combat prowess. Mildly unhinged, people often find his mask and theatrical demeanor unsettling, but the music his lute plays is genuinely inspiring and calming.",
  "history": "Originally a directionless street performer, Sarmenti discovered a mysterious melody in a cemetery that awakened his ambition. His newfound talent led him to perform at the royal court, where he faced cruel mockery and humiliation. In revenge, he performed the demonic melody, resulting in death and dismemberment of the whole court. Regretting his mistakes, he severed his own finger to rid himself of ability to ever again play the cursed melody. He now wanders, hoping to do better for the world, haunted by fragments of that forgotten tune.",
  "race": "Human",
  "gender": "Male",
  "religion": "None",
  "zodiac": "Pisces",
  "traits": [
    "Maniacal",
    "Unserious",
    "Theatrical",
    "Quipster"
  ],
  "status": {
    "physical": 100,
    "mental": 100,
    "affliction": "",
    "description": "In good health and high spirits",
    "wounds": [],
    "diseases": []
  },
  "stats": {
    "strength": 4,
    "agility": 7,
    "intelligence": 5,
    "authority": 3,
    "sociability": 10
  },
  "equipment": [
    "Sickle",
    "Lute",
    "Bells",
    "Dagger"
  ],
  "appearance": {
    "height": "Tall",
    "build": "Lean",
    "skinTone": "Pale",
    "hairColor": "Black",
    "hairStyle": "Long and unkempt",
    "features": "Gaunt face, prominent cheekbones, dark circles under eyes"
  },
  "clothing": {
    "head": "White theatrical mask",
    "body": "Red and black jester's attire with bells",
    "legs": "Dark fitted pants",
    "accessories": "Shoes with bells"
  },
  "combat": {
    "role": "Support",
    "strengths": [
      "Musical inspiration",
      "Precision",
      "Keeps morale up"
    ],
    "weaknesses": [
      "Weak",
      "Frail"
    ]
  },
  "magic": "None",
  "notes": [
    "Never removes his mask, and his presence is accompanied by the jingling bells on his attire",
    "Treats even dire situations theatrically, always talking in rhymes or jokes",
    "Laughs loudly when overtaken by emotion, good or bad",
    "Carries and plays his lute around the hamlet"
  ],
  "tags": [
    "Dancer", "StressHealer", "Frail", "Bleeder", "Buffer", "Executor", "Setup", "Crit", "Unstable", "Entertainer"
  ],
  "relationships": {}
}