{
  "identifier": "leper",
  "title": "Leper",
  "name": "Baldwin",
  "level": 0,
  "money": 0,
  "description": "The Leper is a former king undone by disease and duty. Leprosy has ravaged his body, stealing his sight, his grace, and the face beneath his bronze mask—but not his strength. He swings his massive blade with the weight of his lost kingdom behind it, each strike devastating when it lands, though precision has long since abandoned him. His condition is advanced and visible, yet he neither hides nor apologizes—his mask a courtesy to others. Shunned by fear of contagion, he fills his isolation with poetry and quiet observation of the world's beauty.",
  "history": "The Leper was a compassionate king who contracted leprosy while visiting the sick. When symptoms began to show, his advisors sought to exploit his vulnerability, plotting to usurp the throne. He uncovered their treachery, took up his ceremonial sword, slaughtered them all, and exiled himself before the disease could spread. Aware his time grows short, he has come to the Estate to spend his remaining strength in service—not of his lost kingdom, but of all humankind.",
  "race": "Human",
  "gender": "Male",
  "religion": "The Light",
  "zodiac": "Capricorn",
  "traits": [
    "Humble",
    "Resolute",
    "Stoic",
    "Compassionate",
    "Unbreakable"
  ],
  "status": {
    "physical": 100,
    "mental": 100,
    "affliction": "",
    "description": "In good health and high spirits",
    "wounds": [],
    "diseases": []
  },
  "stats": {
    "strength": 7,
    "agility": 2,
    "intelligence": 6,
    "authority": 6,
    "sociability": 3
  },
  "equipment": [
    "Broken ceremonial greatsword"
  ],
  "appearance": {
    "height": "Tall",
    "build": "Broad",
    "skinTone": "Dark",
    "hairColor": "Black",
    "hairStyle": "Lost to disease",
    "features": "Scarred and disfigured skin"
  },
  "clothing": {
    "head": "Bronze mask with narrow eye slits and a tattered hood",
    "body": "Heavy robes and a golden breastplate, torn and weathered",
    "legs": "Simple pants and boots",
    "accessories": "Gloves and bandaged arms"
  },
  "combat": {
    "role": "Frontliner",
    "strengths": [
      "High damage output",
      "High durability",
      "Calm under pressure"
    ],
    "weaknesses": [
      "Inaccurate",
      "Slow",
      "Short range"
    ]
  },
  "magic": "None",
  "notes": [
    "Speaks in brief, contemplative observations drawn from nature—snow, rain, petals, the changing seasons",
    "Openly acknowledges his leprosy without shame or apology",
    "Expects fear and revulsion from others and accepts it without bitterness",
    "Leprosy has damaged his vision; the mask's narrow slits help him focus"
  ],
  "tags": [
    "Frontline", "Immobile", "ShortReach", "Tank", "SelfSufficient", "Debuffer", "Disruptor", "Setup", 
    "Noble", "Warrior", "Religious", "Outcast", "HeavyHitter", "Just"
  ],
  "relationships": {}
}
